/* Fortune Program */

the_number = random(1, 45)
clrscrn

if the_number = 1 then
    call one
else if the_number = 2 then
    call two
else if the_number = 3 then
    call three
else if the_number = 4 then
    call four
else if the_number = 5 then
     call five
else if the_number = 6 then
    call six
else if the_number = 7 then
     call seven
else if the_number = 8 then
     call eight
else if the_number = 9 then
     call nine
else if the_number = 10 then
    call ten
else if the_number = 11 then
    call eleven
else if the_number = 12 then
    call twelve
else if the_number = 13 then
    call thirteen
else if the_number = 14 then
    call fourteen
else if the_number = 15 then
    call fifteen
else if the_number = 16 then
    call sixteen
else if the_number = 17 then
    call seventeen
else if the_number = 18 then
    call eighteen
else if the_number = 19 then
    call nineteen
else if the_number = 20 then
    call twenty
else if the_number = 21 then
    call twentyone
else if the_number = 22 then
    call twentytwo
else if the_number = 23 then
    call twentythree
else if the_number = 24 then
    call twentyfour
else if the_number = 25 then
    call twentyfive
else if the_number = 26 then
    call twentysix
else if the_number = 27 then
    call twentyseven
else if the_number = 28 then
    call twentyeight
else if the_number = 29 then
    call twentynine
else if the_number = 30 then
    call thirty
else if the_number = 31 then
    call thirtyone
else if the_number = 32 then
    call thirtytwo
else if the_number = 33 then
    call thirtythree
else if the_number = 34 then
    call thirtyfour
else if the_number = 35 then
    call thirtyfive
else if the_number = 36 then
    call thirtysix
else if the_number = 37 then
    call thirtyseven
else if the_number = 38 then
    call thirtyeight
else if the_number = 39 then
    call thirtynine
else if the_number = 40 then
    call forty
else if the_number = 41 then
    call fortyone
else if the_number = 42 then
    call fortytwo
else if the_number = 43 then
    call fortythree
else if the_number = 44 then
    call fortyfour
else if the_number = 45 then
    call fortyfive
else
    exit

one:
    say "A baby is God's opinion that the world should go on."
    say "                   -- Carl Sandburg"
    say " "
    exit

two:
    say "A city is a large community where people are lonesome together."
    say "                   -- Herbert Prochnow"
    say " "
    exit

three:
    say "A fool must now and then be right by chance."
    say " "
    exit

four:
    say "A LISP programmer knows the value of everything, bit the cost of nothing."
    say "                        -- Alan Perlis"
    say " "
    exit

five:
    say "A language that doesn't affect the way you think about programming is not worth knowing."
    say " "
    exit

six:
    say "A penny saved is ridiculous."
    say " "
    exit

seven:
    say "If you have a procedure with ten parameters, you probably missed some."
    say " "
    exit

eight:
    say "If you live to the age of a hundred you have it made because very few people die past"
    say "the age of a hundred."
    say "                              -- George Burns"
    say " "
    exit

nine:
    say "If you think the problem is bad now, just wait until we've solved it."
    say "                      -- Arthur Kasspe"
    say " "
    exit

ten:
    say "If you understand what you're doing, you're not learning anything."
    say " "
    exit

eleven:
    say "Misery no longer loves company. Nowadays it insists on it."
    say "                          -- Russell Baker"
    say " "
    exit

twelve:
    say "Murphy's Law of Research:"
    say"         Enough research will tend to support your theory."
    say " "
    exit

thirteen:
    say "Mythology, n.:"
    say "     The body of a primitive people's beliefs concerning its"
    say "     origin, early history, heroes, deities and so forth, as"
    say "     distinguished from the true accounts which it invents later."
    say "                        -- Ambrose Bierce"
    say " "
    exit

fourteen:
    say "Reality is that which, when you stop believing in it, doesn't go away."
    say "                      -- Philip K. Dick"
    say " "
    exit

fifteen:
    say "The hardest thing in the world to understand is the income tax."
    say "                      -- Albert Einstein"
    say " "
    exit

sixteen:
    say "The human mind treats a new idea the way the body treats a strange protein -- it rejects it."
    say "                                                -- P. Medawar"
    say " "
    exit

seventeen:
    say "The illegal we do immediately. The unconstitutional takes a bit longer."
    say "                               -- Henry Kissinger"
    say " "
    exit

eighteen:
    say "The law will never make men free; it is men who have got to make the law free."
    say "                           -- Henry David Thoreau"
    say " "
    exit

nineteen:
    say "Do what thou wilt be the whole of the law."
    say "               -- Aleister Crowley"
    say " "
    exit

twenty:
    say "You make your own reality."
    say "      -- Jane Roberts"
    say " "
    exit
twentyone:
    say "Put no trust in cryptic comments."
    say " "
    exit

twentytwo:
    say "Rule of Feline Frustration:"
    say "    When your cat has fallen asleep on your lap and looks utterly"
    say "    content and adorable, you will suddenly have to go to the bathroom."
    say " "
    exit

twentythree:
    say "Rule of the Great:"
    say "      When people you greatly admire appear to be thinking deep"
    say "      thoughts, they probably are thinking about lunch."
    say " "
    exit

twentyfour:
    say "Rudin's Law:"
    say "      If there is a wrong way to do something, most people will do it every time."
    say " "
    exit

twentyfive:
    say "Rocky's Lemma of Innovation Prevention"
    say "          Unless the results are known in advance, funding agencies will reject the proposal."
    say " "
    exit

twentysix:
    say "Sanity is the trademark of a weak mind."
    say "             - Mark Harrold"
    say " "
    exit

twentyseven:
    say "Sattinger's Law:"
    say "      It works better if you plug it in."
    say " "
    exit

twentyeight:
    say "SAGITTARIUS (Nov 22 - Dec 21)"
    say "       You are optimistic and enthusiastic. You have a reckless"
    say "       tendency to rely on luck since you lack talent. The majority"
    say "       of Sagittarians are drunks or dope fiends or both. People"
    say "       laugh at you a great deal."
    say " "
    exit

twentynine:
    say "SHIFT TO THE LEFT!  SHIFT TO THE RIGHT!"
    say "POP UP, PUSH DOWN, BYTE, BYTE, BYTE!"
    say " "
    exit

thirty:
    say "Slowly and surely the Unix crept up on the Nintendo user ..."
    say " "
    exit

thirtyone:
    say "                     .,,uod8B8bou,,."
    say "              ..,uod8BBBBBBBBBBBBBBBBRPFT?l!i:."
    say "         ,=m8BBBBBBBBBBBBBBBRPFT?!||||||||||||||"
    say "         !...:!TVBBBRPFT||||||||||!!^^""'   ||||"
    say "         !.......:!?|||||!!^^""'            ||||"
    say "         !.........||||        (\____/)     ||||"
    say "         !.........|||| I AM   / @__@ \     ||||"
    say "         !.........|||| A     (  (oo)  )    ||||"
    say "         !.........|||| CP/CMS `-.~~.-'     ||||"
    say "         !.........|||| PIG     /    \      ||||"
    say "         !.........||||       @/      \_    ||||"
    say "         `.........||||      (/ /    \ \)  ,||||"
    say "          .;.......||||       WW`----'_.-!!|||||"
    say "   .,uodWBBBBb.....||||       _.-!!|||||||||!:'"
    say "!YBBBBBBBBBBBBBBb..!|||:..-!!|||||||!iof68BBBBBb...."
    say "!..YBBBBBBBBBBBBBBb!!||||||||!iof68BBBBBBRPFT?!::   `."
    say "!....YBBBBBBBBBBBBBBbaaitf68BBBBBBRPFT?!:::::::::     `."
    say "!......YBBBBBBBBBBBBBBBBBBBRPFT?!::::::;:!^``;:::       `."
    say "!........YBBBBBBBBBBRPFT?!::::::::::^''...::::::;         iBBbo."
    say "`..........YBRPFT?!::::::::::::::::::::::::;iof68bo.      WBBBBbo."
    say "  `..........:::::::::::::::::::::::;iof688888888888b.     `YBBBP^`"
    say"    `........::::::::::::::::;iof688888888888888888888b.     `"
    say "      `......:::::::::;iof688888888888888888888888888888b."
    say " "
    exit

thirtytwo:
    say "A child of five could understand this! Fetch me a child of five."
    say " "
    exit

thirtythree:
    say "A citizen of America will cross the ocean to fight for democracy, but"
    say "won't cross the street to vote in a national election."
    say "                   -- Bill Vaughn"
    say " "
    exit

thirtyfour:
    say "A closed mouth gathers no foot."
    say " "
    exit

thirtyfive:
    say "A computer, to print out a fact,"
    say "Will divide, multiply, and subtract."
    say "        But this output can be"
    say "        No more than debris,"
    say "If the input was short of exact."
    say "               -- Gigo"
    say " "
    exit

thirtysix:
    say "355/113 -- Not the famous irrational number PI, but an incredible simulation!"
    say " "
    exit

thirtyseven:
    say "43rd Law of Computing:"
    say "            Anything that can go wr"
    say "FORTUNE: SEGMENTATION VIOLATION -- CORE DUMPED"
    say " "
    exit

thirtyeight:
    say "A countryman between two lawyers is like a fish between two cats."
    say "                  -- Benjamin Franklin."
    say " "
    exit

thirtynine:
    say "A crusader's wife slipped from the garrison"
    say "And had an affair with a Saracen."
    say "        She was not oversexed,"
    say "        Or jealous or vexed,"
    say "She just wanted to make a comparison."
    say " "
    exit

forty:
    say "A cynic is a person searching for an honest man, with a stolen lantern."
    say "                  -- Edgar A Shoaff"
    say " "
    exit

fortyone:
    say "I really hate this damned machine"
    say "I wish that they would sell it."
    say "It never does quite what I want"
    say "But only what I tell it."
    say " "
    exit

fortytwo:
    say "If I have not seen as far as others, it is because giants were standing on my shoulders."
    say "          -- Hal Abelson"
    say " "
    exit

fortythree:
    say "If the code and the comments disagree, then both are probably wrong."
    say "          -- Norm Schryer"
    say " "
    exit

fortyfour:
    say "Overload -- core meltdown sequence initiated."
    say " "
    exit

fortyfour:
    say "Pardon this fortune. Database under reconstruction."
    say " "
    exit

fortyfive:
    say "Pascal Users:"
    say "       To show respect for the 354th anniversary (tomorrow) of the"
    say "       death of Blaise Pascal, your programs will be run at half speed."
    say " "
    exit
